interop-mock/src/main/resources/w3c/XMLP-4-request.xml

<?xml version="1.0"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
              xmlns:xsd="http://www.w3.org/2001/XMLSchema"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Body>
    <sb:echoSimpleTypesAsStruct xmlns:sb="http://soapinterop.org/"
          env:encodingStyle="http://www.w3.org/2003/05/soap-encoding">
      <inputFloat xsi:type="xsd:float">@floatValue@</inputFloat>
      <inputInteger xsi:type="xsd:int">@intValue@</inputInteger>
      <inputString xsi:type="xsd:string">@stringValue@</inputString>
    </sb:echoSimpleTypesAsStruct>
  </env:Body>
</env:Envelope>