interop-mock/src/main/resources/whitemesa/soap12/test-rpc/echoSimpleTypesAsStruct-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Body>
      <ns1:echoSimpleTypesAsStruct soapenv:encodingStyle="http://www.w3.org/2003/05/soap-encoding" xmlns:ns1="http://example.org/ts-tests">
         <inputString xsi:type="xsd:string">EchoSimpleTypesAsStruct</inputString>
         <inputInteger id="id0" xsi:type="xsd:int">50</inputInteger>
         <inputFloat id="id1" xsi:type="xsd:float">45.5</inputFloat>
      </ns1:echoSimpleTypesAsStruct>
   </soapenv:Body>
</soapenv:Envelope>