interop-mock/src/main/resources/whitemesa/soap12/add-test-doc-int/XMLP-18.xml

<?xml version="1.0" ?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" 
              xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Header>
    <ns:seekrit xmlns:ns="http://test-xmlp-17" env:role="http://www.w3.org/2003/05/soap-envelope/role/next" env:relay="true" xsi:type="xsd:string">${headerValue}</ns:seekrit>
  </env:Header>
  <env:Body>
    <sb:echoString xmlns:sb="http://soapinterop.org/"
        env:encodingStyle="http://www.w3.org/2003/05/soap-encoding">
      <inputString xsi:type="xsd:string">${inputString}</inputString>
    </sb:echoString>
  </env:Body>
</env:Envelope>
