interop-mock/src/main/resources/whitemesa/soap12/add-test-doc-int/XMLP-15-response.xml

<?xml version="1.0" ?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" 
              xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Body>
    <sb:echoString xmlns:sb="http://soapinterop.org/">
      <inputString xsi:type="xsd:string">${inputString}</inputString>
    </sb:echoString>
  </env:Body>
</env:Envelope>
